#Mon Jul 03 22:43:21 IST 2017
XIE05.S=Le fichier de donn\u00E9es ne peut pas \u00EAtre NULL. 
42XBK=La version de Lucene en cours ''{0}'' ne peut pas lire un index cr\u00E9\u00E9 par la version ''{1}'' de Lucene.
X0Y28.S=L''index ''{0}'' ne peut pas \u00EAtre cr\u00E9\u00E9 sur la table syst\u00E8me ''{1}''. Les utilisateurs ne peuvent pas cr\u00E9er d''index sur les tables syst\u00E8me.
XCL22.S=Le param\u00E8tre {0} ne peut pas \u00EAtre inscrit en tant que param\u00E8tre OUT car il s''agit d''un param\u00E8tre IN. 
X0Y91.S=Impossible de modifier le mode de contrainte de {0}. Cette contrainte ne peut pas \u00EAtre diff\u00E9r\u00E9e.
XSLAE.D=Aucune \u00E9criture ou mise \u00E0 jour sur le fichier de contr\u00F4le situ\u00E9 dans {0} ne peut \u00EAtre effectu\u00E9e.
X0Y46.S=La contrainte ''{0}'' n''est pas valide \: la table r\u00E9f\u00E9renc\u00E9e {1} n''existe pas.
XBCXH.S=Le format de encryptionAlgorithm ''{0}'' n''est pas correct. Le format correct est algorithm/feedbackMode/NoPadding.
XCL40.S=La r\u00E8gle de suppression de la cl\u00E9 \u00E9trang\u00E8re ne peut pas \u00EAtre CASCADE. (La relation engendre un cycle \u00E9tablissant une d\u00E9pendance en cas de suppression de la table avec elle-m\u00EAme. Si l''une des r\u00E8gles de suppression du cycle n''est pas CASCADE, cette relation peut \u00EAtre d\u00E9finie.) 
XSDFH.S=Impossible de sauvegarder la base de donn\u00E9es, une exception d''E/S s''est produite lors de l''\u00E9criture dans le fichier de conteneur de sauvegarde {0}.
XSDAM.S=Une exception s''est produite au cours de la restauration d''un objet SQLData de la classe {0}. La classe indiqu\u00E9e ne peut pas \u00EAtre instanci\u00E9e.
XSAJG.U=portion de m\u00E9moire
XCL13.S=La position de param\u00E8tre ''{0}'' est en dehors des limites. Le nombre de param\u00E8tres pour cette instruction pr\u00E9par\u00E9e est ''{1}''.
42XAL=La table source d''une instruction MERGE doit \u00EAtre une table de base ou une fonction de table.
XCL31.S=Instruction ferm\u00E9e.
XBM04.D=La prise en charge de la fonction de classement n''est pas disponible \u00E0 partir de la JVM pour les param\u00E8tres r\u00E9gionaux de la base de donn\u00E9es ''{0}''.
X0Y55.S=Le nombre de lignes de la table de base ne correspond pas au nombre de lignes d''au moins 1 des index de la table. L''index ''{0}'' de la table ''{1}.{2}'' comprend {3} lignes mais la table de base en comprend {4}. L''intervention sugg\u00E9r\u00E9e consiste \u00E0 recr\u00E9er l''index.
R005=L''esclave de r\u00E9plication a rencontr\u00E9 une erreur fatale pour la base de donn\u00E9es ''{0}''. La r\u00E9plication sera arr\u00EAt\u00E9e.
