#Mon Jul 03 22:43:18 IST 2017
XIE05.S=Es muss eine Datendatei angegeben werden. 
42XBK=Die aktuelle Lucene-Version ''{0}'' kann keinen Index lesen, der von Lucene-Version ''{1}'' erstellt wurde.
X0Y28.S=Index ''{0}'' kann f\u00FCr die Systemtabelle ''{1}'' nicht erstellt werden. Benutzer k\u00F6nnen keine Indizes f\u00FCr Systemtabellen erstellen.
XCL22.S=Parameter {0} kann nicht als OUT-Parameter registriert werden, da er ein IN-Parameter ist. 
X0Y91.S=Constraint-Modus von {0} kann nicht ge\u00E4ndert werden. Er ist kein verz\u00F6gerbarer Constraint.
XSLAE.D=Kontrolldatei in {0} kann nicht geschrieben oder aktualisiert werden.
X0Y46.S=Constraint ''{0}'' ist ung\u00FCltig\: Die referenzierte Tabelle {1} ist nicht vorhanden.
XBCXH.S=Der Verschl\u00FCsselungsalgorithmus ''{0}'' hat nicht das richtige Format. Korrektes Format\: algorithm/feedbackMode/NoPadding.
XCL40.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel darf nicht CASCADE lauten. (Es w\u00FCrde eine Zyklus entstehen, in der eine Tabelle f\u00FCr das mehrstufige L\u00F6schen sich selbst referenzieren w\u00FCrde. Eine der vorhandenen L\u00F6schregeln in der Beziehung ist nicht CASCADE. Die Beziehung kann demzufolge definiert werden, wenn die L\u00F6schregel nicht CASCADE lautet.) 
XSDFH.S=Die Datenbank kann nicht gesichert werden. Beim Schreiben in die Backupcontainerdatei {0} wurde eine I/O-Ausnahme empfangen.
XSDAM.S=Ausnahme beim Wiederherstellen eines SQLData-Objekts der Klasse {0}. Angegebene Klasse kann nicht instanziiert werden.
XSAJG.U=Heap
XCL13.S=Die Parameterposition ''{0}'' liegt au\u00DFerhalb des Bereichs. Die Parameteranzahl f\u00FCr diese vorbereitete Anweisung ist ''{1}''.
42XAL=Die Quelltabelle einer MERGE-Anweisung muss eine Basistabelle oder Tabellenfunktion sein.
XCL31.S=Anweisung geschlossen.
XBM04.D=Collator-Unterst\u00FCtzung von JVM ist nicht verf\u00FCgbar f\u00FCr Datenbankgebietsschema ''{0}''.
X0Y55.S=Die Zeilenanzahl in der Basistabelle stimmt nicht mit der Zeilenanzahl in mindestens einem der Indizes f\u00FCr die Tabelle \u00FCberein. Index ''{0}'' f\u00FCr Tabelle ''{1}.{2}'' hat {3} Zeilen, die Basistabelle jedoch {4} Zeilen. Zur Fehlerberichtigung wird empfohlen, den Index erneut zu erstellen.
R005=Schwerwiegender Fehler bei Replikationsslave f\u00FCr Datenbank ''{0}''. Replikation wird gestoppt.
