#Mon Jul 03 22:43:18 IST 2017
42XBN=Ein Feld und ein Schl\u00FCssel haben denselben Namen\: ''{0}''
XBCXK.S=Der angegebene Verschl\u00FCsselungsschl\u00FCssel stimmt nicht mit dem bei der Erstellung der Datenbank verwendeten Verschl\u00FCsselungsschl\u00FCssel \u00FCberein. Vergewissern Sie sich, dass Sie den richtigen Verschl\u00FCsselungsschl\u00FCssel verwenden, und versuchen Sie es erneut. 
XSDFK.S=Fehler beim Versuch, eine JAR-Datei {0} zu entfernen, die in der Datenbank gespeichert ist. Falsche Datei- oder Verzeichniszugeh\u00F6rigkeit oder -berechtigungen k\u00F6nnen dazu f\u00FChren, dass die Datei nicht entfernt werden kann. Prozesse, die nicht von Derby kontrolliert werden, wie Backup oder Virenpr\u00FCfungen k\u00F6nnten ebenfalls verantwortlich sein.
XSDAP.S=Unerwarteter Fehler wegen fehlendem Speicherplatz beim Versuch, eine Zeile auf Seite {0} zu aktualisieren. Werte der internen Felder zum Zeitpunkt des Fehlers\: slot \= {2}, recordId \= {3}, newColumnList \= {4}, nextColumn \= {5}, mode \= {6}, nextPortionHandle \= {7}, page dump \= {1}.
X0Y67.S=In einer verschachtelten Verbindung kann kein ROLLBACK-Vorgang ausgegeben werden, solange es einen anstehenden Vorgang in der \u00FCbergeordneten Verbindung gibt.
XSAJJ.U=interne
XCL16.S=ResultSet nicht ge\u00F6ffnet. Vorgang ''{0}'' nicht zul\u00E4ssig. Stellen Sie sicher, dass Autocommit deaktiviert ist.
X0X86.S=0 ist ein ung\u00FCltiger Parameterwert f\u00FCr ResultSet.absolute(int row).
X0Y85.S=Die Derby-Eigenschaft ''{0}'' identifiziert eine Klasse, die nicht instanziiert werden kann\: ''{1}''. Weitere Einzelheiten finden Sie in der n\u00E4chsten Ausnahme.
XCL34.S=Aufgrund von L\u00F6schregeleinschr\u00E4nkungen kann die Tabelle nicht als abh\u00E4ngig von der Tabelle {0} definiert werden. (Die Beziehung umfasst zwei oder mehr Tabellen, sodass die Tabelle f\u00FCr das mehrstufige L\u00F6schen auf sich selbst verweist. F\u00FCr alle \u00FCbrigen Tabellen gilt die L\u00F6schregel CASCADE.)
XBM07.D=Systemstart nicht erfolgreich. Das Boot-Kennwort muss eine Mindestl\u00E4nge von 8 Byte haben.
X0Y58.S=Der Versuch, zur Tabelle ''{0}'' ein Constraint f\u00FCr Prim\u00E4rschl\u00FCssel hinzuzuf\u00FCgen, war nicht erfolgreich, weil es f\u00FCr die Tabelle bereits ein Constraint dieses Typs gibt. F\u00FCr eine Tabelle kann es nur ein Prim\u00E4rschl\u00FCssel-Constraint geben.
42XAO=Unterabfragen sind in den WHEN [ NOT ] MATCHED-Klauseln von MERGE-Anweisungen nicht zul\u00E4ssig.
XBCA0.S=Im {0}-Cache kann kein neues Objekt mit dem Schl\u00FCssel {1} erstellt werden, da es bereits im Cache vorhanden ist. 
2201W=Zeilenanzahl f\u00FCr FIRST/NEXT muss >\= 1 und Zeilenanzahl f\u00FCr LIMIT muss >\= 0 sein.
XCL52.S=Die Anweisung wurde abgebrochen oder wegen Timeouts abgebrochen.
XIE08.S=Es gibt keine Spalte mit dem Namen {0}. 
XCL07.S=Cursor ''{0}'' wurde geschlossen. Pr\u00FCfen Sie, ob das automatische Festschreiben deaktiviert ist.
X0Y85.S.1=Die Derby-Eigenschaft ''{0}'' identifiziert eine Klasse, die die org.apache.derby.catalog.SequencePreallocator-Schnittstelle nicht implementiert.
XSRS0.S=Die Datenbank kann nicht eingefroren werden, da sie bereits eingefroren ist.
XCL25.S=Parameter {0} kann nicht als Parameter des Typs {1} registriert werden, weil er dem Typ {2} zugeordnet wird und beide Typen inkompatibel sind.
X0X95.S=Vorgang ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil es ein offenes ResultSet gibt, das von diesem Objekt abh\u00E4ngig ist.
R008=Replikationsmaster-Rolle gestoppt f\u00FCr Datenbank ''{0}''.
XSLAH.D=Sie aktualisieren eine schreibgesch\u00FCtzte Datenbank.
